Courses/7140/Lectures/Maintenance/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Software Maintenance</title>
<!-- 2018-10-29 Mon 00:29 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Prabhaker Mateti" />
<meta  name="description" content="CEG7380 Cloud Computing"
 />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../"> UP </a>
 |
 <a accesskey="H" href="../../"> HOME </a>
</div><div id="preamble" class="status">
<a href="../../"> ../../</a>
</div>
<div id="content">
<h1 class="title">Software Maintenance</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Software Quality</a></li>
<li><a href="#sec-2">2. Software Maintenance</a></li>
<li><a href="#sec-3">3. Refactoring</a></li>
<li><a href="#sec-4">4. References</a></li>
<li><a href="#sec-5">5. End</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Software Quality</h2>
<div class="outline-text-2" id="text-1">
<ol class="org-ol">
<li><a href="../Overview/state-of-SE.html">../Overview/state-of-SE.html</a>
</li>
<li><a href="../Overview/hoare-quality-1972.pdf">../Overview/hoare-quality-1972.pdf</a> 3pp Hoare's list of qualities
</li>
<li><a href="../Overview/metrics.html">Software Engineering Metrics</a>
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Software Maintenance</h2>
<div class="outline-text-2" id="text-2">
<ol class="org-ol">
<li>Bug Fixes
</li>
<li>Enhancements
<ol class="org-ol">
<li>Functionality, GUI, &#x2026;
</li>
<li><a href="../Overview/state-of-SE.html">Software Quality</a> Improvements

<ol class="org-ol">
<li>Improved Performance, Decreased size
</li>
<li>Code Structure: Refactoring
</li>
</ol>
</li>
</ol>
</li>
</ol>
</div>
</div>


<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Refactoring</h2>
<div class="outline-text-2" id="text-3">
<ol class="org-ol">
<li><a href="./refactoring.html">Refactoring</a> is the modification of software source code
to improve software qualities.
</li>
<li>Code Refactoring
</li>
<li>Bad Code Smells
</li>
<li>Big Refactorings
</li>
<li><a href="../OODesign">OODesign</a>
</li>
<li>Anti-Patterns
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> References</h2>
<div class="outline-text-2" id="text-4">
<ol class="org-ol">
<li><a href="../Overview/hoare-quality-1972.pdf">../Overview/hoare-quality-1972.pdf</a> 3pp Hoare's list of qualities
</li>
<li><a href="https://calhoun.nps.edu/bitstream/handle/10945/40278/Schneidewind_The_State_of_Software.pdf;jsessionid=0DD31AEA1944EB07EA2B814BF4A137CB?sequence=4">https://calhoun.nps.edu/bitstream/handle/10945/40278/Schneidewind_The_State_of_Software.pdf;jsessionid=0DD31AEA1944EB07EA2B814BF4A137CB?sequence=4</a>
</li>
<li><a href="https://link.springer.com/article/10.1186/s40411-018-0046-4">https://link.springer.com/article/10.1186/s40411-018-0046-4</a> A
survey of search-based refactoring for software maintenance, 2018
</li>
<li><a href="https://onlinelibrary.wiley.com/journal/1096908x">https://onlinelibrary.wiley.com/journal/1096908x</a> Journal of
Software Maintenance: Research and Practice
</li>
</ol>
</div>
</div>


<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> End</h2>
<div class="outline-text-2" id="text-5">
</div>
</div>
</div>
<div id="postamble" class="status">
<hr size=1>Copyright &copy; 2016 <a href="mailto:pmateti@wright.edu">pmateti@wright.edu</a> &bull; <a href="http://www.wright.edu/~pmateti"> www.wright.edu/~pmateti</a>  2016-01-11
</div>
</body>
</html>
